app/controllers/android_controller.rb

	def login
		number=params[:number]
		pw=params[:password]
		password=Digest::MD5.hexdigest(pw)
		m=Student.where("number"=>number,"password"=>password).first
---
SELECT `students`.* FROM `students` WHERE `students`.`number` = '2010912021' AND `students`.`password` = '4297f44b13955235245b2497399d7a93' ORDER BY `students`.`id` ASC LIMIT 1

	def getnotice
                msg=Notice.all
---
SELECT `notices`.* FROM `notices`

    def getuserinf
    	token=params[:token]
    	user=Student.where("token"=>token).first
---
SELECT `students`.* FROM `students` WHERE `students`.`token` = 'y5BLtMC0yF8L' ORDER BY `students`.`id` ASC LIMIT 1

    def changepassword
    	number=params[:number]
    	pw=params[:oldpassword]
    	newpw=params[:newpassword]
    	password=Digest::MD5.hexdigest(pw)
    	m=Student.where("number"=>number,"password"=>password).first
    	if(m==nil)
			str={"status"=>100}
		else
			password=Digest::MD5.hexdigest(newpw)
			m.password=password
			m.save
---
SELECT `students`.* FROM `students` WHERE `students`.`number` = '2010912021' AND `students`.`password` = '81dc9bdb52d04dc20036dbd8313ed055' ORDER BY `students`.`id` ASC LIMIT 1
UPDATE `students` SET `password` = '4297f44b13955235245b2497399d7a93', `updated_at` = '2014-04-27 20:32:10' WHERE `students`.`id` = 2

    def getscore
    	token=params[:token]
    	user=Student.where("token"=>token).first
    	score=Score.where("name"=>user.name)
---
SELECT `students`.* FROM `students` WHERE `students`.`token` = 'y5BLtMC0yF8L' ORDER BY `students`.`id` ASC LIMIT 1
SELECT `scores`.* FROM `scores` WHERE `scores`.`name` = '咸睿'

    def getsyllabus
    	token=params[:token]
    	user=Student.where("token"=>token).first
    	myclass=Myclass.where("name"=>user.myclass).first
    	syllabus=myclass.curriculum.split(/,/)
    	content=[]
    	for i in syllabus do
    		specialized=Specialized.find(i.to_i)
---
SELECT `students`.* FROM `students` WHERE `students`.`token` = 'y5BLtMC0yF8L' ORDER BY `students`.`id` ASC LIMIT 1
SELECT `myclasses`.* FROM `myclasses` WHERE `myclasses`.`name` = '软件工程一班' ORDER BY `myclasses`.`id` ASC LIMIT 1
SELECT `specializeds`.* FROM `specializeds` WHERE `specializeds`.`id` = 2 LIMIT 1

    def setfeedback
        token=params[:token]
        content=params[:content]
        user=Student.where("token"=>token).first
        Feedback.create({"number"=>user.number,"content"=>content})
---
SELECT `students`.* FROM `students` WHERE `students`.`token` = 'y5BLtMC0yF8L' ORDER BY `students`.`id` ASC LIMIT 1
INSERT INTO `feedbacks` (`content`, `created_at`, `number`, `updated_at`) VALUES ('test', '2014-05-12 11:25:00', '2010912021', '2014-05-12 11:25:00')