app/controllers/web_controller.rb

	def register
                name=params[:name]
                pw=params[:password]
                number=params[:number]
                grade=params[:grade]
                myclass=params[:myclass]
                password=Digest::MD5.hexdigest(pw)
                code=AndroidHelper.mkrandom(12)
                str=nil
                m=Student.where("name"=>name).first
---
SELECT `students`.* FROM `students` WHERE `students`.`name` = '咸睿' ORDER BY `students`.`id` ASC LIMIT 1