app/controllers/web_controller.rb

	 def login
                name=params[:name]
                pw=params[:password]
                password=Digest::MD5.hexdigest(pw)
                m=Student.where("name"=>name,"password"=>password).first
---
SELECT `students`.* FROM `students` WHERE `students`.`name` = 'admin' AND `students`.`password` = '21232f297a57a5a743894a0e4a801fc3' ORDER BY `students`.`id` ASC LIMIT 1

	def register
        name=params[:name]
        pw=params[:password]
        number=params[:number]
        grade=params[:grade]
        myclass=params[:myclass]
        password=Digest::MD5.hexdigest(pw)
        code=AndroidHelper.mkrandom(12)
        str=nil
        m=Student.where("number"=>number).first
        if(m==nil)
        	user=Student.new
        	user.name=name
        	user.password=password
        	user.number=number
        	user.grade=grade
        	user.token=code
        	user.myclass=myclass
        	user.save
---
SELECT `students`.* FROM `students` WHERE `students`.`number` = '2010912021' ORDER BY `students`.`id` ASC LIMIT 1
INSERT INTO `students` (`created_at`, `grade`, `myclass`, `name`, `number`, `password`, `token`, `updated_at`) VALUES ('2014-01-15 00:09:04', '2010', 'class', 'xianrui', '2010912021', '202cb962ac59075b964b07152d234b70', 'me7xJrWurjhd', '2014-01-15 00:09:04')

    def addstudent
    	name=params[:name]
    	number=params[:number]
    	grade=params[:grade]
    	myclass=params[:myclass]
    	sex=params[:sex]
    	major=params[:major]

    	password=number[number.length-6,number.length]
    	password=Digest::MD5.hexdigest(password)
    	code=AndroidHelper.mkrandom(12)
    	str=nil
        m=Student.where("number"=>number).first
                if(m==nil)
                        user=Student.new
                        user.name=name
                        user.password=password
                        user.number=number
                        user.grade=grade
                        user.token=code
                        user.sex=sex
                        user.myclass=myclass
                        user.major=major
                        user.save
---
SELECT `students`.* FROM `students` WHERE `students`.`number` = '2010912021' ORDER BY `students`.`id` ASC LIMIT 1
INSERT INTO `students` (`created_at`, `grade`, `major`, `myclass`, `name`, `number`, `password`, `sex`, `token`, `updated_at`) VALUES ('2014-05-12 19:37:27', '计算机科学与信息工程系', '计算机科学与技术', '软件工程一班', '毕文娟', '2010912009', '56062413a0786189467aec8c5893743d', '0', 'HlDpjdcQMe2d', '2014-05-12 19:37:27')

    def getstudent
    	stu=Student.all
---
SELECT `students`.* FROM `students`

	def uploadstudent
		id=params[:id].to_i
		name=params[:name]
    	number=params[:number]
    	grade=params[:grade]
    	myclass=params[:myclass]
    	sex=params[:sex]
    	major=params[:major]
	 	user=Student.find(id)
	 	user.name=name
        user.number=number
        user.grade=grade
        user.sex=sex
        user.myclass=myclass
        user.major=major
        user.save
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
UPDATE `students` SET `number` = '111', `grade` = '11', `sex` = '0', `myclass` = '11', `major` = '11', `updated_at` = '2014-05-12 14:29:22' WHERE `students`.`id` = 1

	def addspecialized
		 name=params[:name]
		 teacher=params[:teacher]
		 intro=params[:intro]
		 period=params[:period]
		 location=params[:location]
		 str=nil
                m=Specialized.where("name"=>name).first
		 if(m==nil)
                        user=Specialized.new
                        user.name=name
                        user.teacher=teacher
                        user.intro=intro
                        user.period=period
                        user.location=location
                        user.save
---
SELECT `specializeds`.* FROM `specializeds` WHERE `specializeds`.`name` = 'test' ORDER BY `specializeds`.`id` ASC LIMIT 1
INSERT INTO `specializeds` (`created_at`, `intro`, `location`, `name`, `period`, `teacher`, `updated_at`) VALUES ('2014-01-15 01:59:36', 'test', '315', 'test', '40', 'test', '2014-01-15 01:59:36')

	def getspecialized
		spe=Specialized.all
---
SELECT `specializeds`.* FROM `specializeds`

	def addnotice

		 title=params[:title]
                 content=params[:content]
		 msg=Notice.new
		 msg.title=title
		 msg.content=content
		 msg.save
---
INSERT INTO `notices` (`content`, `created_at`, `title`, `updated_at`) VALUES ('\"this is a test msg\"', '2014-01-25 02:57:42', '\"test1\"', '2014-01-25 02:57:42')

	def getnotice
		msg=Notice.all
---
SELECT `notices`.* FROM `notices`

	def rmnotice
		id=params[:id].to_i
		Notice.delete(id)
---
DELETE FROM `notices` WHERE `notices`.`id` = 2

	def uploadnotice
		id=params[:id].to_i
		title=params[:title]
        content=params[:content]
		msg=Notice.find(id)
		msg.title=title
		msg.content=content
		msg.save
---
SELECT `notices`.* FROM `notices` WHERE `notices`.`id` = 4 LIMIT 1
UPDATE `notices` SET `title` = '2014.4.5关于10级学生补考通知', `content` = '关于10级学生补考通知（计算机科学与信息工程系）\r\n计算机10级学生于2014年5月5日在实验楼进行补考，此次为毕业前最后一次机会，希望大家珍惜，准时参加。', `updated_at` = '2014-05-12 19:11:11' WHERE `notices`.`id` = 4

	def getfeedback
		msg=Feedback.all
---
SELECT `feedbacks`.* FROM `feedbacks`